{"backend": "tensorflow", "keras_version": "2.1.6-tf", "config": {"layers": [{"config": {"batch_input_shape": [null, 81920], "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "dense_219", "activation": "linear", "bias_constraint": null, "units": 32, "use_bias": true, "trainable": true, "kernel_constraint": null, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_153", "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_153", "trainable": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [1], "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_136", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "dense_220", "trainable": true, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 32, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_154", "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"gamma_constraint": null, "epsilon": 0.001, "name": "batch_normalization_154", "trainable": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "axis": [1], "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation_137", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "name": "dense_221", "trainable": true, "activation": "softmax", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 2, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_69"}, "class_name": "Sequential"}